Stachu1/STM32_Watch/firmware/main.c
        // Update button state history
        Button_State_Handler();
    }

    // Begin new PWM cycle
    pwm_step++;
    if (pwm_step >= BRIGHTNESS_STEPS * 3)
    {
        // Reset pwm_step
        pwm_step = 0;

        // Update hands brightness and position for the next cycle
        Hands_Update_Handler();
    }

    // Get hand index for the current time slot
    u8 hand_idx = pwm_step / BRIGHTNESS_STEPS;
    u8 local_step = pwm_step % BRIGHTNESS_STEPS;

    // Turn off previous hand LED and turn on the LED for the current hand at the start of its brightness cycle
    if (local_step == 0)
    {
        // Turn off all LEDs
        GPIOA->BSRR = 0b1000011110010 << 16;
        GPIOB->BSRR = 0b111101100 << 16;

        if (hands[hand_idx].brightness > 0 && hands[hand_idx].position > 0)
        {
            u8 led_on = hands[hand_idx].position - 1;
            leds[led_on].port[6] = (1 << leds[led_on].pin);
        }
    }

    // Turn off the LED for the current hand at the end of its brightness cycle
    if (local_step >= hands[hand_idx].brightness && hands[hand_idx].position > 0)
    {
        u8 led_off = hands[hand_idx].position - 1;
        leds[led_off].port[6] = (1 << (leds[led_off].pin + 16));
    }
}

// 0.2Hz RTC Interrupt Handler for hands update
// (5.25us @ 32MHz ~ 168 cycles)
void RTC_IRQ_Handler(void)
{
    // Clear the flag
    EXTI->PR = EXTI_PR_PIF20;

    // Check if Wakeup Timer caused the interrupt
    if (RTC->ISR & RTC_ISR_WUTF) 
    {
        // Clear RTC Wakeup Flag
        RTC->WPR = 0xCA;
        RTC->WPR = 0x53;
        RTC->ISR &= ~RTC_ISR_WUTF;
        RTC->WPR = 0xFF; // Re-lock

        if (current_mode == MODE_TIME)
        {
            RTC_Set_Hands();
        }
    }
}

// EXTI Interrupt Handler for buttons
// (2us @ 32MHz ~ 64 cycles)
void EXTI0_1_IRQ_Handler(void)
{
    // Check PB0 btn_down
    if (EXTI->PR & (1 << 0))
    {
        EXTI->PR = (1 << 0); // Clear the flag
    }

    // Check PB1 btn_up
    if (EXTI->PR & (1 << 1))
    {
        EXTI->PR = (1 << 1); // Clear the flag
    }
    last_activity = millis;
}

// EXTI Interrupt Handler for IMU AWT & Double Tap
void EXTI4_15_IRQ_Handler(void)
{
    // Check PA8 (INT2 - Wrist Tilt)
    if (EXTI->PR & (1 << 8))
    {
        EXTI->PR = (1 << 8); // Clear the flag
    }

    // Check PA15 (INT1 - Double Tap)
    if (EXTI->PR & (1 << 15))
    {
        EXTI->PR = (1 << 15); // Clear the flag
        if (current_mode == MODE_PENDULUM_SIM)
        {
            sim_double_tap = true;
        }
        else
        {
            Print_str("Changing brightness\n");
            brightness_level = (brightness_level == MAX_BRIGHTNESS_LEVEL) ? MIN_BRIGHTNESS_LEVEL : brightness_level + 1;
            Hand_Set(0, hands[0].position);
            Hand_Set(1, hands[1].position);
            Hand_Set(2, hands[2].position);
        }
    }
    last_activity = millis;
}

// ====== Utility Functions ======

// Do nothing for 4 clock cyles
void Spin(u32 count)
{
    while (count--) __asm__ volatile ("nop");
}

// Delay microseconds based on Spin 
// (for delay above 100ms use Delay_ms)
void Delay_us(u32 us)
{
    u32 spins = (us * (SYSCLK/1000)) / 4000;
    Spin(spins);
}

// Delay milliseconds based on Delay_us
void Delay_ms(u32 ms)
{
    (void)ms;
    u32 hundereds = ms / 100;
    u32 rest = ms - hundereds * 100;
    for (u32 i=0; i<hundereds; i++)
    {
        Delay_us(100000);
    }
    Delay_us(rest * 1000);
}

// Init GPIOs for the LEDs
void GPIO_Init(void)
{
    // Enable GPIOA and GPIOB clocks
    RCC->IOPENR |= RCC_IOPENR_IOPAEN | RCC_IOPENR_IOPBEN;
    // Enable SYSCFG Clock
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    // === LEDs ===
    // Set PA1, PA4, PA5, PA6, PA7, PA12 to output (MODE = 01)
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE1, 0x1);   // PA1 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE4, 0x1);   // PA4 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE5, 0x1);   // PA5 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE6, 0x1);   // PA6 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE7, 0x1);   // PA7 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE12, 0x1);  // PA12 as output
    // Set PB2, PB3, PB5, PB6, PB7, PB8 to output (MODE = 01)
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE2, 0x1);   // PB2 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE3, 0x1);   // PB3 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE5, 0x1);   // PB5 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE6, 0x1);   // PB6 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE7, 0x1);   // PB7 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE8, 0x1);   // PB8 as output

    // === UART ===
    if (DEBUG)
    {
        // Set alterative pin func
        BF_SET(GPIOA->MODER, GPIOA_MODER_MODE2, 0x2);   // PA2
        BF_SET(GPIOA->MODER, GPIOA_MODER_MODE3, 0x2);   // PA3
        // Enable alterative func
        BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL2, 0x4);    // PA2
        BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL3, 0x4);    // PA3
    }

    // === I2C ===
    if (USE_IMU)
    {
    // Set alterative pin func
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE9, 0x2);   // PA9
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE10, 0x2);  // PA10
    // Set output open-drain
    GPIOA->OTYPER |= (GPIOA_OTYPER_OT9 | GPIOA_OTYPER_OT10);
    // Set high speed
    BF_SET(GPIOA->OSPEEDR, GPIOA_OSPEEDR_OSPEED9, 0x2);
    BF_SET(GPIOA->OSPEEDR, GPIOA_OSPEEDR_OSPEED10, 0x2);
    // Enable alterative func
    BF_SET(GPIOA->AFRH, GPIOA_AFRH_AFSEL9, 0x1);    // PA9
    BF_SET(GPIOA->AFRH, GPIOA_AFRH_AFSEL10, 0x1);   // PA10

    // === EXTI for IMU Interrupts ===
    // Configure PA8 and PA15 as Input
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE8, 0x0);
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE15, 0x0);
    // Map PA8 and PA15 to EXTI Line 8 and 15
    BF_SET(SYSCFG_COMP->EXTICR3, SYSCFG_COMP_EXTICR3_EXTI8, 0x0);
    BF_SET(SYSCFG_COMP->EXTICR4, SYSCFG_COMP_EXTICR4_EXTI15, 0x0);
    // Enable Rising Edge triggers
    EXTI->RTSR |= (EXTI_RTSR_RT8 | EXTI_RTSR_RT15);
    EXTI->IMR  |= (EXTI_IMR_IM8 | EXTI_IMR_IM15);
    // Enable EXTI4_15 Interrupt (IRQ 7)
    NVIC->ISER |= (1 << 7);
    }

    // === Buttons ===
        // Configure PB0 and PB1 as Input
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE0, 0x0);   // PB0 as input
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE1, 0x0);   // PB1 as input
    // Enable Internal Pull-Ups
    BF_SET(GPIOB->PUPDR, GPIOB_PUPDR_PUPD0, 0x1);
    BF_SET(GPIOB->PUPDR, GPIOB_PUPDR_PUPD1, 0x1);
    // Map PB0 and PB1 to EXTI Line 0 and 1
    BF_SET(SYSCFG_COMP->EXTICR1, SYSCFG_COMP_EXTICR1_EXTI0, 0x1); // PB0
    BF_SET(SYSCFG_COMP->EXTICR1, SYSCFG_COMP_EXTICR1_EXTI1, 0x1); // PB1
    // Enable Falling Edge triggers
    EXTI->FTSR |= (EXTI_FTSR_FT0 | EXTI_FTSR_FT1); // Press
    EXTI->IMR  |= (EXTI_IMR_IM0 | EXTI_IMR_IM1);   // Unmask
    // Enable EXTI0_1 Interrupt (IRQ 5)
    NVIC->ISER |= (1 << 5);
}

