Stachu1/STM32_Watch/firmware/main.c
// Button state handler called every 1ms in the TIM21 IRQ Handler
void Button_State_Handler(void)
{
    // Update button state history
    btn_down.state_history = (btn_down.state_history << 1) | (GPIOB->IDR & (1 << 0) ? 1 : 0);
    btn_up.state_history = (btn_up.state_history << 1) | (GPIOB->IDR & (1 << 1) ? 1 : 0);

    // Check state_history for stable press or release
    if ((btn_down.state_history & 0xFF) == 0)
    {
        btn_down.down = true;
    }
    else if ((btn_down.state_history & 0xFF) == 0xFF)
    {
        if (btn_down.down)
        {
            if (millis > btn_down.ignore_until) btn_down.pressed = true;
            btn_down.down = false;
        }
    }

    if ((btn_up.state_history & 0xFF) == 0)
    {
        btn_up.down = true;
    }
    else if ((btn_up.state_history & 0xFF) == 0xFF)
    {
        if (btn_up.down)
        {
            if (millis > btn_up.ignore_until) btn_up.pressed = true;
            btn_up.down = false;
        }
    }
}

// Hands handler called every 3*BRIGHTNESS_STEPS ms in the TIM21 IRQ Handler
void Hands_Update_Handler(void)
{
    for (u8 i=0; i<3; i++)
    {
        // Update hand position to new_position
        // (prevents ghosting when hand position changes durring its time slot)
        if (hands[i].new_position != 255)
        {
            hands[i].position = hands[i].new_position;    // Update hand position to new_position
            hands[i].new_position = 255;               // Reset new_position
            if ((1 << brightness_level) < hands[i].brightness)
            {
                // Make sure max brightness is not exceeded (Hands are reset every brightness change)
                hands[i].brightness = (1 << brightness_level);
            }
        }

        // Set brightness and continue if hand is static
        if (hands[i].tick_div == 0)
        {
            hands[i].brightness = (1 << brightness_level);
            continue;
        };

        // Update tick and handle breathing effect
        hands[i].tick++;
        if (hands[i].tick == hands[i].tick_div)
        {
            // Reset tick and update brightness
            hands[i].tick = 0;
            u8 b_step = (1 << (brightness_level - MIN_BRIGHTNESS_LEVEL));
            if (hands[i].fading_in)
            {
                // Increase brightness until max, then start fading out
                if (hands[i].brightness + b_step > (1 << brightness_level))
                {
                    hands[i].fading_in = false;
                    hands[i].brightness -= b_step;
                }
                else hands[i].brightness += b_step;
            }
            else
            {
                // Decrease brightness until min, then start fading in
                if (hands[i].brightness - b_step < 0)
                {
                    hands[i].fading_in = true;
                    hands[i].brightness += b_step;
                }
                else hands[i].brightness -= b_step;
            }
        }
    }
}

// Init TIM21 and enable its interrupt
// for SW PWM control of the LEDs and ms couunting
void TIM21_Init(void)
{
    // Enable TIM21 peripheral clock
    RCC->APB2ENR |= RCC_APB2ENR_TIM21EN;

    // Run at SYSCLK with no prescaler aiming for 10kHz frequency
    TIM21->PSC = 0;
    TIM21->ARR = SYSCLK / 10000;
    
    // Enable update interrupt and start counter
    TIM21->DIER |= TIM21_DIER_UIE;
    TIM21->CR1 |= TIM21_CR1_CEN;

    // Enable TIM21 interrupt in NVIC
    NVIC->ISER |= (1 << 20);
}

// Set the position of a hand (1-12, 0 for off)
inline void Hand_Set(u8 hand_index, u8 position)
{
    if (hand_index > 2 || position > 12) return;
    hands[hand_index].new_position = position;
}

// Init UART at #BUAD
void UART_Init(void)
{
    if (!DEBUG) return;

    // Enable peripheral clock
    RCC->APB1ENR |= RCC_APB1ENR_USART2EN;

    // Disable USART
    USART2->CR1 &= ~USART2_CR1_UE;

    // Set word len, Parity ctrl, 1 Stop bit, Enable TX
    USART2->CR1 &= ~(USART2_CR1_M0 | USART2_CR1_M1);
    USART2->CR1 &= ~USART2_CR1_PCE;
    BF_SET(USART2->CR2,USART2_CR2_STOP, 0x0);
    USART2->CR1 |= USART2_CR1_TE;

    // Set USART div (sysclk / baud_rate)
    USART2->BRR = (SYSCLK / BAUD) & 0xFFFF;         

    // Enable USART
    USART2->CR1 |= USART2_CR1_UE;
}

// Deinit UART
void UART_Deinit(void)
{
    // Disable UART
    USART2->CR1 &= ~USART2_CR1_UE;

    // Reset UART
    RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_USART2RST;

    // Set PA2 and PA3 back to Analog Mode (0x3)
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE2, 0x3);
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE3, 0x3);

    // Clear AF selection
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL2, 0x0);
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL3, 0x0);

    // Disable peripheral clock
    RCC->APB1ENR &= ~RCC_APB1ENR_USART2EN;
}

// Sends char over UART
void Print_char(u8 c)
{
    if (!DEBUG) return;
    while (!(USART2->ISR & USART2_ISR_TXE)) Spin(1);
    BF_SET(USART2->TDR, USART2_TDR_TDR, c);
}

// Sends string over UART
void Print_str(c *str)
{
    if (!DEBUG) return;
    while (*str)
    {
        Print_char(*(str++));
    }
}

// Sends u32 over UART
void Print_u32(u32 num)
{
    if (!DEBUG) return;
    if (num == 0)
    {
        Print_char('0');
        return;
    }

    u8 digits[10];  
    u32 num_len = 0;

    while (num)
    {
        digits[num_len++] = '0' + (num % 10);
        num /= 10;
    }

    for (u32 i=num_len; i>0; i--)
    {
        Print_char(digits[i - 1]);
    }
}

// Sends i32 over UART
void Print_i32(i32 num)
{
    if (!DEBUG) return;
    if (num == 0)
    {
        Print_char('0');
        return;
    }

    b32 is_neg = (num < 0) ? true : false;
    if (is_neg) num = -num;

    u8 digits[10];  
    u32 num_len = 0;

    while (num)
    {
        digits[num_len++] = '0' + (num % 10);
        num /= 10;
    }

    if (is_neg) Print_char('-');
    for (u32 i=num_len; i>0; i--)
    {
        Print_char(digits[i - 1]);
    }
}

// Sends q32 (q16.16) over UART
void Print_q32(q32 num)
{
    if (!DEBUG) return;
    if (num == 0)
    {
        Print_str("0.0000");
        return;
    }

    if (num < 0)
    {
        Print_char('-');
        num = -num;
    }

    u32 int_part = (u32)(num >> FIXED_SHIFT);
    u32 frac_part = ((u32)(num & (FIXED_ONE - 1)) * 10000) >> FIXED_SHIFT;

    Print_u32(int_part);
    Print_char('.');

    // Print leading zeros for the fraction
    if (frac_part < 1000) Print_char('0');
    if (frac_part < 100)  Print_char('0');
    if (frac_part < 10)   Print_char('0');
    
    Print_u32(frac_part);
}

// Get Ambient light intensity
// May take a while in low light (~500ms)
u8 Ambient_Sense(void)
{
    u32 ambl = 0;
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE4, 0x1);   // PB4 as output
    GPIOB->BSRR |= GPIOB_BSRR_BS4;
    Delay_ms(1);
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE4, 0x0);   // PB4 as input
    while (GPIOB->IDR & GPIOB_IDR_ID4 && ambl != 2080768) ambl++;
    return (u8)(255 - (ambl >> 13));
}

// Init ADC for measuring battery voltage and core temperature
void ADC_Init(void)
{
    // Enable peripheral clock and set ADC clock to PCLK/2
    RCC->APB2ENR |= RCC_APB2ENR_ADCEN;
    BF_SET(ADC->CFGR2, ADC_CFGR2_CKMODE, 0x1);

    // Disable ADC
    if (ADC->CR & ADC_CR_ADEN)
    {
        ADC->CR |= ADC_CR_ADDIS;
        while (ADC->CR & ADC_CR_ADEN) Spin(1);
    }

    // Calibration
    ADC->CR |= ADC_CR_ADCAL;
    while (ADC->CR & ADC_CR_ADCAL) Spin(1);

    // Config ADC
    ADC->CFGR1 |= ADC_CFGR1_DISCEN;
    ADC->CFGR1 &= ~ADC_CFGR1_CONT;
    ADC->CCR |= (ADC_CCR_TSEN | ADC_CCR_VREFEN);
    ADC->SMPR |= ADC_SMPR_SMPR_WIDTH;

