Stachu1/STM32_Watch/firmware/main.c
    // Configure Oversampling x256 & 8 bit shift
    ADC->CFGR2 |= ADC_CFGR2_OVSE;
    BF_SET(ADC->CFGR2, ADC_CFGR2_OVSR, 0x7);
    BF_SET(ADC->CFGR2, ADC_CFGR2_OVSS, 0x8);

    // Enable ADC
    ADC->ISR |= ADC_ISR_ADRDY;
    ADC->CR |= ADC_CR_ADEN;
    while (!(ADC->ISR & ADC_ISR_ADRDY)) Spin(1);
}

// Deinit ADC
void ADC_Deinit(void)
{
    // Stop ongoint conversions
    if (ADC->CR & ADC_CR_ADSTART)
    {
        ADC->CR |= ADC_CR_ADSTP;
        while (ADC->CR & ADC_CR_ADSTP) Spin(1);
    }

    // Disable ADC
    if (ADC->CR & ADC_CR_ADEN)
    {
        ADC->CR |= ADC_CR_ADDIS;
        while (ADC->CR & ADC_CR_ADEN) Spin(1);
    }

    // Disable voltage references
    ADC->CCR &= ~(ADC_CCR_TSEN | ADC_CCR_VREFEN);

    // Disable ADC voltage regulator
    ADC->CR |= ADC_CR_ADVREGEN;

    // Disable peripheral clock
    RCC->APB2ENR &= ~RCC_APB2ENR_ADCEN;
}

// Measures VDDA in mV
// (Needs ADC_Init)
u32 ADC_Get_VDDA(void)
{
    // Set Vref & Max conversion time
    ADC->CHSELR = ADC_CHSELR_CHSEL17;

    // Turn off the LEDs to reduce voltage drop druring measurment
    u8 h = hands[0].position;
    u8 m = hands[1].position;
    u8 s = hands[2].position;
    Hand_Set(0, 0);
    Hand_Set(1, 0);
    Hand_Set(2, 0);

    // Wait for hands to update
    while (hands[0].new_position != 255) Spin(1);
    // Start ADC conversion, wait, read
    ADC->CR |= ADC_CR_ADSTART;
    while (!(ADC->ISR & ADC_ISR_EOC)) Spin(1);
    Hand_Set(0, h);
    Hand_Set(1, m);
    Hand_Set(2, s);

    u32 raw_vref = (u32)(ADC->DR & ADC_DR_DATA_MASK);
    u32 vdda_mV = (3000 * VREFINT_CAL) / raw_vref;
    return vdda_mV;
}

// Measures core temperature in m°C
// (Needs ADC_Init)
i32 ADC_Get_Temp(void)
{
    // Get VDDA
    u32 vdda_mV = ADC_Get_VDDA();

    // Set Tsen & Max conversion time
    ADC->CHSELR = ADC_CHSELR_CHSEL18;

    // Start ADC conversion, wait, read
    ADC->CR |= ADC_CR_ADSTART;
    while (!(ADC->ISR & ADC_ISR_EOC)) Spin(1);
    u32 raw_tsen = (u32)(ADC->DR & ADC_DR_DATA_MASK);
    u32 tsen_cal =  raw_tsen * vdda_mV / 3000;

    // (TS_CAL2_TEMP - TS_CAL1_TEMP) / (rav_Tsen - TS_CAL1) + TS_CAL1_TEMP
    i32 core_temp = 100000 / (TS_CAL2 - TS_CAL1) * (tsen_cal - TS_CAL1) + 30000;
    return core_temp;
}

// Init I2C for the IMU
void I2C_Init(void)
{
    // Enable peripheral clock
    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

    // Disable I2C
    I2C1->CR1 &= ~I2C1_CR1_PE;
    
    // Configure timing
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_PRESC, 0x03);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SCLL, 0x13);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SCLH, 0x0F);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SCLDEL, 0x04);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SDADEL, 0x02);
    
    // Enable I2C
    I2C1->CR1 |= I2C1_CR1_PE;

    // Set alterative pin func
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE9, 0x2);   // PA9
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE10, 0x2);  // PA10
}

// Deinit I2C
void I2C_Deinit(void)
{
    while (I2C1->ISR & I2C1_ISR_BUSY);

    // Disable the I2C peripheral
    I2C1->CR1 &= ~I2C1_CR1_PE;

    // Disable the I2C1 clock in RCC
    RCC->APB1ENR &= ~RCC_APB1ENR_I2C1EN;

    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE9, 0x3);   // PA9 to analog
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE10, 0x3);  // PA10 to analog
}

// Write data to a slave reg @ addr, reg over I2C
void I2C_Write(u8 addr, u8 reg, u8 *data, u8 size)
{
    // Wait until I2C is not busy
    while (I2C1->ISR & I2C1_ISR_BUSY) Spin(1);

    // Set address, number of bytes, and generate START
    I2C1->CR2 = (addr << 1);
    BF_SET(I2C1->CR2, I2C1_CR2_NBYTES, size + 1);
    I2C1->CR2 |= I2C1_CR2_START | I2C1_CR2_AUTOEND;

    // Select the reg
    while (!(I2C1->ISR & I2C1_ISR_TXIS)) Spin(1);
    I2C1->TXDR = reg;

    // Transmit the data
    for (u32 i = 0; i < size; i++)
    {
        while (!(I2C1->ISR & I2C1_ISR_TXIS)) Spin(1);
        I2C1->TXDR = data[i];
    }

    // Wait for stop flag (set by AUTOEND)
    while (!(I2C1->ISR & I2C1_ISR_STOPF)) Spin(1);

    // Clear stop flag
    I2C1->ICR |= I2C1_ICR_STOPCF;            
}

// Read data from a slave reg @ addr, reg over I2C
void I2C_Read(u8 addr, u8 reg, u8 *buf, u8 size)
{
    // Wait until I2C is not busy
    while (I2C1->ISR & I2C1_ISR_BUSY) Spin(1);

    I2C1->CR2 = (addr << 1) | (1 << 16); // NBYTES = 1
    I2C1->CR2 |= I2C1_CR2_START; 
    
    while (!(I2C1->ISR & I2C1_ISR_TXIS)) Spin(1);
    I2C1->TXDR = reg;
    while (!(I2C1->ISR & I2C1_ISR_TC)) Spin(1);

    // Restart and Read
    I2C1->CR2 = (addr << 1) | I2C1_CR2_RD_WRN | (size << 16) | I2C1_CR2_START | I2C1_CR2_AUTOEND;
    
    for (int i = 0; i < size; i++)
    {
        while (!(I2C1->ISR & I2C1_ISR_RXNE)) Spin(1);
        buf[i] = I2C1->RXDR;
    }

    while (!(I2C1->ISR & I2C1_ISR_STOPF)) Spin(1);
    I2C1->ICR |= I2C1_ICR_STOPCF;
}

// Init the LSM6DSM IMU
void IMU_Init(void)
{
    // === Set Accel to 416Hz, +/- 4g, high performance disabled ===
    // CTRL1_XL register (ODR_XL) (FS_XL)
    u8 buf = (0x6 << 4) | (0x2 << 2);
    I2C_Write(IMU_ADDR, 0x10, &buf, 1);
    // CTRL6_C register (XL_HM_MODE)
    buf = (0x1 << 4);
    I2C_Write(IMU_ADDR, 0x15, &buf, 1);

    // === Enables double tap detection ===
    // TAP_CFG register (INTERRUPTS_ENABLE) (TAP_Z_EN)
    buf = (0x1 << 7) | (0x1 << 1);
    I2C_Write(IMU_ADDR, 0x58, &buf, 1);

    // TAP_THS_6D register (TAP_THS)
    buf = 0x5;
    I2C_Write(IMU_ADDR, 0x59, &buf, 1);
    // INT_DUR2 register (DUR3:0) (QUIET1:0) (SHOCK1:0)
    buf = (0x5 << 4) | (0x5 << 2) | (0x3);
    I2C_Write(IMU_ADDR, 0x5A, &buf, 1);
    // WAKE_UP_THS register (SINGLE_DOUBLE_TAP)
    buf = (0x1 << 7);
    I2C_Write(IMU_ADDR, 0x5B, &buf, 1);

    // === Enable absolute wrist tilt detection == 
    // CTRL10_C register (WRIST_TILT_EN) (FUNC_EN)
    buf = (0x1 << 7) | (0x1 << 2);
    I2C_Write(IMU_ADDR, 0x19, &buf, 1);
    // FUNC_CFG_ACCESS (FUNC_CFG_EN) ( FUNC_CFG_EN_B)
    buf = (0x1 << 7) | (0x1 << 5);
    I2C_Write(IMU_ADDR, 0x01, &buf, 1);

    // A_WRIST_TILT_THS Absolute Wrist Tilt threshold register 1 LSB = 15.625 mg
    buf = 0x32;
    I2C_Write(IMU_ADDR, 0x58, &buf, 1);
    // A_WRIST_TILT_Mask register (Xneg) (Zpos)
    buf = (0x1 << 3);
    I2C_Write(IMU_ADDR, 0x59, &buf, 1);
    // Disable embedded functions register
    buf = 0x0;
    I2C_Write(IMU_ADDR, 0x01, &buf, 1);

