Stachu1/STM32_Watch/firmware/main.c
    // === Interrupt routing ===
    // MD1_CFG register (INT1_DOUBLE_TAP)
    buf = (0x1 << 3);
    I2C_Write(IMU_ADDR, 0x5E, &buf, 1);
    // DRDY_PULSE_CFG register (INT2_WRIST_TILT)
    buf = 0x1;
    I2C_Write(IMU_ADDR, 0x0B, &buf, 1);
}

// Deinit the IMU
void IMU_Deinit(void)
{
    // Power down the Gyro & Accel
    // Register 0x11 (CTRL2_G) = 0x00
    u8 buf[] = {0x0, 0x0};
    I2C_Write(IMU_ADDR, 0x10, buf, 2);

    // Clear the Interrupt masks
    I2C_Write(IMU_ADDR, 0x5E, buf, 1);
    I2C_Write(IMU_ADDR, 0x0B, buf, 1);
}

// Read acceleration from the IMU
void IMU_Get_Accel(i16 *x, i16 *y, i16 *z)
{
    u8 buf[6];
    I2C_Read(IMU_ADDR, 0x28, buf, 6);
    *x = (i16)((buf[1] << 8) | buf[0]);
    *y = (i16)((buf[3] << 8) | buf[2]);
    *z = (i16)((buf[5] << 8) | buf[4]);
}

// Read temperature from the IMU in m°C
i32 IMU_Get_Temp(void)
{
    static i32 last_temp = 25000; // Start at 25°C
    u32 timeout = 10000;
    u8 buf[2];

    while (timeout--)
    {
        I2C_Read(IMU_ADDR, 0x1E, buf, 1);
        if (buf[0] & 0x4) break;
    }

    if (buf[0] & 0x4)
    {
        I2C_Read(IMU_ADDR, 0x20, buf, 2);

        // Combine into  i16
        i16 raw_temp = (i16)((buf[1] << 8) | buf[0]);

        // Convert raw_temp to m°C
        last_temp = (i32)((raw_temp * 125) >> 5) + 25000;
    }

    return last_temp;
}


// Init RTC for hand updates every second
void RTC_Init(void)
{
    // Disable backup domain write protection
    PWR->CR |= PWR_CR_DBP;

    // Start LSE and wait until ready
    if (!(RCC->CSR & RCC_CSR_LSERDY))
    {
        RCC->CSR |= RCC_CSR_LSEON;
        while (!(RCC->CSR & RCC_CSR_LSERDY)) Spin(10);
    }

    // Set LSE as RTC clock source
    BF_SET(RCC->CSR, RCC_CSR_RTCSEL, 0x1);

    // Enable RTC
    RCC->CSR |= RCC_CSR_RTCEN;
}

// Set RTC time (12h format, hours max 12)
void RTC_Set_Time(u8 hours, u8 minutes, u8 seconds)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Disable write protection
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    // Enter initialization mode
    RTC->ISR |= RTC_ISR_INIT;
    while (!(RTC->ISR & RTC_ISR_INITF)) Spin(10);

    // Set RTC prescaler for 1Hz time base (LSE is 32.768 kHz)
    BF_SET(RTC->PRER, RTC_PRER_PREDIV_A, 0x7F);
    BF_SET(RTC->PRER, RTC_PRER_PREDIV_S, 0xFF);

    // Set 12h format
    RTC->CR |= RTC_CR_FMT;

    // Set time in BCD format
    u32 temp_tr = 0;
    temp_tr |= ((hours / 10) << RTC_TR_HT_LSB) | ((hours % 10) << RTC_TR_HU_LSB);
    temp_tr |= ((minutes / 10) << RTC_TR_MNT_LSB) | ((minutes % 10) << RTC_TR_MNU_LSB);
    temp_tr |= ((seconds / 10) << RTC_TR_ST_LSB) | (seconds % 10);
    RTC->TR = temp_tr;

    // Exit initialization mode
    RTC->ISR &= ~RTC_ISR_INIT;

    // Wait for synchronization
    RTC->ISR &= ~RTC_ISR_RSF; 
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Enable write protection
    RTC->WPR = 0xFF;
}

// Get RTC time
void RTC_Get_Time(u8 *hours, u8 *minutes, u8 *seconds)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Read time
    u32 tr = RTC->TR;
    *hours = ((tr & RTC_TR_HT_MASK) >> RTC_TR_HT_LSB) * 10 + ((tr & RTC_TR_HU_MASK) >> RTC_TR_HU_LSB);
    *minutes = ((tr & RTC_TR_MNT_MASK) >> RTC_TR_MNT_LSB) * 10 + ((tr & RTC_TR_MNU_MASK) >> RTC_TR_MNU_LSB);
    *seconds = ((tr & RTC_TR_ST_MASK) >> RTC_TR_ST_LSB) * 10 + ((tr & RTC_TR_SU_MASK) >> RTC_TR_SU_LSB);
}

// Enable RTC 0.2Hz interrupt for hand updates
void RTC_Wakeup_Init(void)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Disable Write Protection
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    // Disable Wakeup Timer to configure it
    RTC->CR &= ~RTC_CR_WUTE;

    // Wait for access allowed
    while (!(RTC->ISR & RTC_ISR_WUTWF)) Spin(10);

    // Configure Clock Source for 1Hz
    // WUCKSEL = 0b100 selects the 1Hz clock (RTCCLK div by prescalers)
    RTC->CR &= ~(RTC_CR_WUCKSEL_MASK << RTC_CR_WUCKSEL_LSB);
    RTC->CR |= (0x4 << RTC_CR_WUCKSEL_LSB);

    // Clear Wakeup Timer flag and EXTI pending bit
    RTC->ISR &= ~RTC_ISR_WUTF;
    EXTI->PR = EXTI_PR_PIF20;

    // For 0.2Hz clock, WUTR = 4 means 5 second interval (Interval = WUTR + 1)
    RTC->WUTR = 4;

    // Enable Interrupt and Timer
    RTC->CR |= RTC_CR_WUTIE | RTC_CR_WUTE;

    // Enable Write Protection
    RTC->WPR = 0xFF;

    // RTC Wakeup is connected to EXTI Line 20
    EXTI->IMR |= EXTI_IMR_IM20;    // Interrupt Mask: Enable line 20
    EXTI->RTSR |= EXTI_RTSR_RT20;   // Rising Trigger: Enable

    // Enable RTC global interrupt in NVIC
    NVIC->ISER |= (1 << 2);
}

// Update hand new_positions based on current RTC time
void RTC_Set_Hands(void)
{
    u8 h, m, s;
    RTC_Get_Time(&h, &m, &s);

    // Map time to hand positions
    u32 hand_h = h;
    if (hand_h > 12) hand_h -= 12;
    if (hand_h == 0) hand_h = 12;

    u32 hand_m = (m < 5) ? 12 : (m / 5);

    u32 hand_s = (u32)s + (m % 5) * 60;
    hand_s = (hand_s < 25) ? 12 : (hand_s / 25);

    // Set hand new_positions based on current time
    Hand_Set(0, hand_h);
    Hand_Set(1, hand_m);
    Hand_Set(2, hand_s);
}

// ====== Mode Handlers ======

// Handle mode changes and mode-specific logic
void Mode_Handler(void)
{
    switch (current_mode)
    {
        case MODE_TIME:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changing brightness\n");
                brightness_level = (brightness_level == MAX_BRIGHTNESS_LEVEL) ? MIN_BRIGHTNESS_LEVEL : brightness_level + 1;
                RTC_Set_Hands();
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            break;
        case MODE_VOLTAGE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode temperature\n");
                current_mode = MODE_TEMPERATURE;
                Mode_Temperature_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Voltage_Handler(false);
            break;
        case MODE_TEMPERATURE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Temperature_Handler(false);
            break;
        case MODE_TIME_SETTING:
            Mode_Time_Setting_Handler(false);
            break;
        case MODE_PENDULUM_SIM:
            if (btn_down.down && btn_up.down)
            {
                if (IMU_Enabled)
                {
                    Print_str("Disabling IMU\n");
                    IMU_Deinit();
                    I2C_Deinit();
                    IMU_Enabled = false;
                }
                else
                {
                    Print_str("Enabling IMU\n");
                    I2C_Init();
                    IMU_Init();
                    IMU_Enabled = true;
                }
                Print_str("Mode time\n");
                current_mode = MODE_TIME;
                RTC_Set_Hands();
                btn_down.ignore_until = millis + 300;
                btn_up.ignore_until = millis + 300;                
            }
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changing brightness\n");
                brightness_level = (brightness_level == MAX_BRIGHTNESS_LEVEL) ? MIN_BRIGHTNESS_LEVEL : brightness_level + 1;
                Hand_Set(0, hands[0].position);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time\n");
                current_mode = MODE_TIME;
                RTC_Set_Hands();
            }
            Mode_Pendulum_Sim_Handler(false);
            break;
    }
}

