Stachu1/STM32_Watch/firmware/main.c
// Voltage mode: map battery voltage to hand position
void Mode_Voltage_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_idx = 0;
    static b8 done = false;

    if (reset)
    {
        last_update = millis;
        done = false;
        u32 vdda_mV = ADC_Get_VDDA();
        Print_str("Battery Voltage: ");
        Print_u32(vdda_mV);
        Print_str(" mV\n");

        // Map 2.0V-3.2V to 0-12 hand index (100mV per step)
        hand_idx = ((vdda_mV - 2000) / 100);
        if (hand_idx > 12) hand_idx = 12;
        if (hand_idx == 0) done = true;
        Hand_Set(0, 12);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    if (done) return;

    // Wait for hands position to be pulled from new_position
    if (hands[0].new_position != 255) return;

    // Update hand positions gradually for smooth animation
    if (millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        u8 new_pos = (hands[0].position == 12) ? 1 : hands[0].position + 1;
        Hand_Set(0, new_pos);
        if (new_pos >= hand_idx) done = true;
    }
}

// Temperature mode: map IMU temperature to hand position
void Mode_Temperature_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_h_idx = 0;
    static u8 hand_m_idx = 0;
    static b8 done = false;

    if (reset)
    {
        last_update = millis;
        done = false;
        u32 temp_mC = IMU_Enabled ? IMU_Get_Temp() : ADC_Get_Temp();
        Print_str("Temperature: ");
        Print_u32(temp_mC);
        Print_str(" mC\n");

        // Clamp temp to 0°C-65°C range (0-64999 mC)
        if (temp_mC < 0) temp_mC = 0;
        if (temp_mC > 64999) temp_mC = 64999;

        // Map 0°C-60°C to 0-12 hand_h index (5°C per step)
        // and 0.5°C per step for hand_m index
        hand_h_idx = temp_mC / 5000;
        hand_m_idx = (temp_mC - hand_h_idx * 5000) / 500;
        if (hand_h_idx > 12) hand_h_idx = 12;
        if (hand_m_idx == 0) hand_m_idx = 12;
        Print_str("\n");
        Hand_Set(0, 12);
        Hand_Set(1, 12);
        Hand_Set(2, 0);
        return;
    }

    if (done) return;

    // Wait for hands position to be pulled from new_position
    if (hands[0].new_position != 255) return;

    // Update hand positions gradually for smooth animation
    if (millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        done = true;
        if (hand_h_idx != 0 && hands[0].position != hand_h_idx)
        {
            done = false;
            u8 new_pos = (hands[0].position == 12) ? 1 : hands[0].position + 1;
            Hand_Set(0, new_pos);
        }

        if (hand_m_idx != 0 && hands[1].position != hand_m_idx)
        {
            done = false;
            u8 new_pos = (hands[1].position == 12) ? 1 : hands[1].position + 1;
            Hand_Set(1, new_pos);
        }
    }
}


void Mode_Time_Setting_Handler(b8 reset)
{
    static u32 last_update = 0;
    static enum {
        ENTRY,
        SET_HOURS,
        SET_MINUTES,
    } stage;
    static u8 h = 0, m = 0;

    if (reset)
    {
        // On entry, read RTC and round min down to nearest 5
        stage = ENTRY;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    switch (stage)
    {
    case ENTRY:
        if (millis - last_update >= STATS_FRAME_TIME / 2)
        {
            last_update = millis;
            Hand_Set(0, (hands[0].position == 12) ? 1 : hands[0].position + 1);
        }
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_HOURS;
            Print_str("Setting Hours\n");
            h = 12;
            Hand_Set(0, h);
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            if (USE_IMU)
            {
                current_mode = MODE_PENDULUM_SIM;
                Mode_Pendulum_Sim_Handler(true);
            }
            else
            {
                current_mode = MODE_TIME;
                RTC_Set_Hands();
            }
        }
        break;
    case SET_HOURS:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_MINUTES;
            Print_str("Setting Minutes\n");
            Hand_Set(0, h);
            m = 60;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            h = (h == 12) ? 1 : h + 1;
            Hand_Set(0, h);
        }
        break;
    case SET_MINUTES:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            current_mode = MODE_TIME;
            RTC_Set_Time(h, m, 0);

            // Set hand new_positions based on current time
            Hand_Set(0, h);
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
            Hand_Set(2, 12);
            Print_str("Time Set\n");
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            m = (m > 55) ? 5 : m + 5;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        break;
    }
}

// Pendulum sim mode: display a simple pendulum simulation
void Mode_Pendulum_Sim_Handler(b8 reset)
{
    static u32 last_update = 0;
    static q32 alpha = 0;
    static q32 omega = 0;

    if (reset)
    {
        alpha = 0;
        omega = 0;
        sim_double_tap = false;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    // Let the user know that IMU is disabled
    if (!IMU_Enabled)
    {
        if (millis - last_update >= 3*STATS_FRAME_TIME)
        {
            last_update = millis;
            Hand_Set(0, hands[0].position == 3 ? 9 : 3);
        }
        return;
    }

    // Update simulation
    if (millis - last_update >= SIM_DT)
    {
        last_update = millis;

        // Get raw accel data from IMU
        i16 raw_x, raw_y, raw_z;
        IMU_Get_Accel(&raw_x, &raw_y, &raw_z);

        // Convert raw accel (+/- 4g) to q32
        q32 accel_x = (q32)raw_x << 3;
        q32 accel_y = (q32)raw_y << 3;

        // Scale down angle to fit 64 sin table
        u8 table_idx = (alpha >> (FIXED_SHIFT - 6))  & 63;
        q32 sin_v = SIN_LUT[table_idx];
        q32 cos_v = SIN_LUT[(table_idx + 16) & 63];

        // Rotate accel vector by alpha to align with hand and apply as acceleration to omega
        q32 accel_aligned = -(accel_x >> (FIXED_SHIFT / 2)) * (sin_v >> (FIXED_SHIFT / 2));
        accel_aligned -= (accel_y >> (FIXED_SHIFT / 2)) * (cos_v >> (FIXED_SHIFT / 2));

