Stachu1/STM32_Watch/firmware/main.c
        // Integrate accel to get angular velocity
        // Multiply by dt and 1/(2*Pi*r) ~= 11
        // Divide by 1000 to convert ms to s
        omega += (accel_aligned * SIM_DT * 11) >> 10;

        // Multiply by friction factor (0.98) to prevent runaway and add damping
        omega -= (omega * SIM_FRICTION) >> FIXED_SHIFT;

        if (sim_double_tap)
        {
            sim_double_tap = false;
            omega += (omega > 0) ? SIM_AFTER_TAP_SPEED : -SIM_AFTER_TAP_SPEED;
        }

        // Integrate omega to get angle
        // Multiply by dt and divide by 1000 to convert ms to s
        alpha += (omega * SIM_DT) >> 10;

        // Add 1/12/2 for proper rounding
        u32 hand_pos = alpha + FIXED_ONE / 24;

        // Map to 0-255
        hand_pos = (hand_pos >> (FIXED_SHIFT - 8)) & 0xFF;

        // Mpa to 1-12 hand index (avoiding division)
        hand_pos = ((hand_pos * 3) >> 6);
        Hand_Set(0, (hand_pos == 0) ? 12 : hand_pos);

        if (omega > SIM_INACTIVITY_THS || -omega > SIM_INACTIVITY_THS)
        {
            last_activity = millis;
        }
    }
}

// ====== Power Management =====

// Enter Stop Mode for deep sleep with low power consumption
void Enter_Stop_Mode(void)
{
    // Disable RTC wakeup timer
    EXTI->IMR &= ~EXTI_IMR_IM20;

    // Deinit UART & ADC
    UART_Deinit();
    ADC_Deinit();

    if (IMU_Enabled)
    {
        // Set IMU to 26Hz
        u8 buf = (0x2 << 4) | (0x2 << 2);
        I2C_Write(IMU_ADDR, 0x10, &buf, 1);
    }

    // Reset Hands
    Hand_Set(0, 0);
    Hand_Set(1, 0);
    Hand_Set(2, 0);
    while (hands[0].new_position != 255) Spin(1);

    // Make sure all LED pins are low
    GPIOA->BSRR = 0b1000011110010 << 16;
    GPIOB->BSRR = 0b111101100 << 16;

    // Ensure all I2C transmissions are complete
    while (I2C1->ISR & I2C1_ISR_BUSY);
    I2C1->ICR |= I2C1_ICR_STOPCF;

    TIM21->CR1 &= ~TIM21_CR1_CEN;
    RCC->APB2ENR &= ~RCC_APB2ENR_TIM21EN;

    // PWR Control: LPSDSR (Low-power regulator) + Clear PDDS (Stop Mode)
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_LPSDSR;
    PWR->CR &= ~PWR_CR_PDDS;

    // Set SLEEPDEEP bit in System Control Register
    SCB->SCR |= SCB_SCR_SLEEPDEEP;

    // Clear Wakeup Flag
    PWR->CR |= PWR_CR_CWUF;

    // Wait For Interrupt
    __asm volatile ("wfi");
}

// Restore clock settings after waking up from Stop Mode
void Wakeup_Handler(void)
{
    // Enable PWR clock
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;

    // Set voltage regulator to 1.2V (Range 3)
    while (PWR->CSR & PWR_CSR_VOSF) __asm__ volatile ("nop");
    BF_SET(PWR->CR, PWR_CR_VOS, 0x3); 
    while (PWR->CSR & PWR_CSR_VOSF) __asm__ volatile ("nop");

    // Enable clocks for peripherals
    RCC->APB2ENR |= RCC_APB2ENR_TIM21EN;
    TIM21->CR1 |= TIM21_CR1_CEN;
    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

    // Reinit peripherals
    GPIO_Init();
    UART_Init();
    ADC_Init();

    // Reset variables
    millis = 0;
    last_activity = 0;
    current_mode = MODE_TIME;
    btn_down.ignore_until = 300;
    btn_up.ignore_until = 300;

    // Re-enable RTC wakeup interrupt and update hands to current time
    EXTI->IMR |= EXTI_IMR_IM20;
    RTC_Set_Hands();

    if (IMU_Enabled)
    {
        // Set IMU back to 416Hz, +/- 4g
        u8 buf = (0x6 << 4) | (0x2 << 2);
        I2C_Write(IMU_ADDR, 0x10, &buf, 1);
    }
}
